Pandas

In [24]:
import pandas as pd
import numpy as np
import copy

In [9]:
tabela = pd.DataFrame({'nome':['Rafael', 'Joao', 'Rafael', 'Maria'], 'nota':[10,9,8,7]})
tabela

     nome  nota
0  Rafael    10
1    Joao     9
2  Rafael     8
3   Maria     7

0    Rafael
1      Joao
2    Rafael
3     Maria
Name: nome, dtype: object

In [10]:
#para buscar na tabela a coluna de nomes
tabela.nome

0    Rafael
1      Joao
2    Rafael
3     Maria
Name: nome, dtype: object

In [20]:
#Busca na coluna nome na posição 2 
tabela.nome[2]

'Rafael'

In [16]:
#Busca na coluna nome na posição 2 
tabela.loc[2,'nome']

'Rafael'

In [17]:
#Média
tabela.groupby('nome').mean()

        nota
nome
Joao     9.0
Maria    7.0
Rafael   9.0

In [19]:
tabela.groupby('nome').count()

        nota
nome
Joao       1
Maria      1
Rafael     2

In [25]:
# passando de pandas para numpy
tabela2 = np.array(tabela)

#se eu alterar algo no array tabela 2 eu vou alterar todo a a lista então se nao desejar fazer esta alteração no original faça uma copia 
tabela3 = copy.deepcopy(tabela)

In [27]:
tabela3.loc[0,'nota'] = 3

tabela

     nome  nota
0  Rafael    10
1    Joao     9
2  Rafael     8
3   Maria     7

In [28]:
tabela3

     nome  nota
0  Rafael     3
1    Joao     9
2  Rafael     8
3   Maria     7